vault backup: 2026-07-09 20:52:29: add BABOK note
